#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2018/6/1 10:50
# @Author  : Kaiwen Xue
# @File    : ctrip_hotel_review_tags.py
# @Software: PyCharm
import requests
import re
import datetime

pre_url = "http://hotels.ctrip.com/hotel/"
m = 712800
n = 1
post_url = ".html"
results = {}
total_hotels = 0
start = datetime.datetime.now()

while n < 101:
    url = pre_url + str(m + n) + post_url
    tag_pattern = "住客印象</span>(.*)</a></div><div class='comment_box_bar_new clearfix'>"
    r = requests.get(url)
    html = r.text.encode(r.encoding).decode()
    tags_raw = re.findall(tag_pattern, html)

    if tags_raw:
        for raw in tags_raw:
            tag_raw_lists = raw.split('</a> <a')

        for raw_data in tag_raw_lists:
            starts = raw_data.rfind('>')
            left_bracket = raw_data.rfind('(')
            right_bracket = raw_data.rfind(')')
            tag = str(raw_data[starts+1:left_bracket])
            count = int(raw_data[left_bracket+1:right_bracket])
            results[tag] = count + results.get(tag, 0)

        total_hotels += 1

    n += 1

ends = datetime.datetime.now()

print(results)
print('Total hotel numbers:', total_hotels, '\nRunning time:', ends-start)

# 441300: r_1 = {'房间': 9576, '位置': 6013, '服务': 11059, '环境': 5835, '早餐': 2868, '性价比': 5788, '干净': 1135, '设施': 4339, '安静': 172, '前台': 739, '老板': 160, '交通': 2202, '地铁': 440, '游泳': 494, '儿童': 290, '卫生': 183, '豪华': 216, '夜生活': 206, '大海': 45, '沙滩': 41, '停车': 122, '接送机': 46, '机场': 17}
# 441400: r_2 = {'房间': 5738, '干净': 481, '位置': 3431, '性价比': 2981, '沙滩': 461, '环境': 3532, '设施': 2053, '服务': 6298, '大海': 244, '接送机': 3, '免费': 12, '机场': 1, '前台': 185, '夜生活': 77, 'KTV': 64, '卫生': 80, '老板': 28, '设计风格': 34, '停车': 74, '景点': 16, '火车站': 142, '早餐': 1657, '网络': 4, '交通': 1186, '安静': 248, '态度': 9, '汽车站': 4, '地铁': 370, '美女': 3, '家的感觉': 3, '古香古色': 1, '晒太阳': 1, '品茶读书': 1, '院落': 1}
# 473800: r_3 = {'房间': 5424, '交通': 1695, '位置': 4707, '干净': 809, '性价比': 1381, '地铁': 433, '服务': 5771, '停车': 2, '环境': 1015, '设施': 2220, '早餐': 254, '老板': 87, '态度': 14, '卫生': 150, '前台': 19, '接送机': 3086, '机场': 2470, '古香古色': 262, '安静': 299, '隔音': 3, '火车站': 203, '空调': 5, '洗漱': 5, '地方特色': 41, '院落': 38, '建筑': 24}
# 428200: r_4 = {'房间': 14161, '交通': 5447, '位置': 10481, '地铁': 1673, '服务': 14331, '性价比': 7125, '环境': 5465, '设施': 1250, '早餐': 807, '干净': 3167, '大海': 655, '沙滩': 456, '卫生': 105, '前台': 27, '老板': 10}
# 432800: r_5 = {'服务': 3750, '房间': 4029, '位置': 2594, '干净': 435, '性价比': 2053, '隔音': 41, '早餐': 871, '环境': 2409, '观景': 229, '设施': 1449, '沙滩': 535, '游泳': 415, '卫生': 4, '老板': 4, '交通': 1090, '安静': 105, '大海': 47, '夜生活': 11, '停车': 14, '儿童': 288}
# 457300: r_6 = {'房间': 5749, '位置': 3205, '交通': 2251, '性价比': 3000, '服务': 3665, '地铁': 747, '干净': 1124, '卫生': 14, '设施': 1237, '环境': 2625, '大海': 368, '沙滩': 168, '安静': 146, '景点': 158, '老板': 59, '早餐': 871, '宠物': 28, '古香古色': 14, '晒太阳': 13, '美女': 11, '院落': 11, '地方特色': 10, '晚餐': 1, '床': 1, '前台': 190, '停车': 3, '卫生间': 2}
# 445300: r_7 = {'房间': 7250, '汽车站': 5, '性价比': 4390, '早餐': 1466, '位置': 5596, '老板': 60, '设施': 2215, '服务': 8410, '环境': 4584, '安静': 1169, '干净': 550, '靠山': 2, '交通': 1838, '接送机': 42, '机场': 18, '地方特色': 70, '卫生': 125, '停车': 16, '地铁': 398, '美景': 292}
# 513300: r_8 = {'位置': 7044, '服务': 11926, '早餐': 2367, '房间': 11271, '交通': 5558, '设施': 3007, '火车站': 720, '性价比': 5199, '景点': 288, '环境': 4792, '免费': 544, '前台': 425, '水果': 405, '干净': 1839, '卫生': 120, '安静': 67, '设计风格': 118, '文艺': 82, '接送机': 2911, '机场': 1786, '地铁': 1326, '网络': 8, '老板': 93, '沙滩': 13, '大海': 10, '床': 6}
# 8063500：r_9 = {'性价比': 4962, '服务': 12658, '房间': 11433, '环境': 5657, '干净': 2376, '设施': 4209, '位置': 9090, '卫生': 108, '空调': 14, '交通': 2687, '早餐': 3791, '火车站': 504, '安静': 241, '前台': 36, '地铁': 914, '设计风格': 306, '地方特色': 42, '小资': 25, '文艺': 24, '免费': 549, '老板': 72, '大海': 841, '夜生活': 27}
# 4423000: r_10 = {'房间': 13006, '老板': 489, '干净': 3155, '游泳': 212, '服务': 10457, '环境': 8558, '位置': 4516, '性价比': 6480, '设施': 6781, '设计风格': 21, '地方特色': 12, '早餐': 3461, '交通': 395, '地铁': 153, '安静': 995, '机场': 112, '豪华': 308, '卫生': 220, '前台': 26, '美女': 12, '停车': 39, '网络': 14, '景点': 690, '夜生活': 757, '儿童': 1737, '火车站': 165, '古香古色': 63, '晒太阳': 108, '床': 78}
# 5981100: r_11 = {'接送机': 229, '机场': 131}
# 371700: r_12 = {'老板': 378, '环境': 1824, '服务': 3575, '房间': 2916, '干净': 1444, '位置': 1492, '卫生': 707, '院落': 27, '性价比': 1509, '安静': 181, '美女': 297, '古香古色': 13, '早餐': 542, '景点': 13, '夜生活': 211, '交通': 802, '沙滩': 685, '游泳': 110, '设施': 845, '火车站': 334, '卫生间': 10, '前台': 758, '网络': 576, '态度': 296, '停车': 258, '地铁': 74, 'KTV': 15, '汽车站': 2, '隔音': 20, '观景': 28, '家的感觉': 20}
# 392500: r_13 = {'位置': 5655, '交通': 3796, '房间': 8472, '性价比': 5220, '服务': 8627, '地铁': 163, '早餐': 1584, '设施': 818, '环境': 3820, '大海': 32, '干净': 838, '儿童': 1283, '老板': 12, '隔音': 4, '卫生': 74, 'KTV': 8, '安静': 131, '火车站': 5, '建筑': 184, '院落': 184, '前台': 495, '机场': 10, '接送机': 9, '汽车站': 5}
# 701800: r_14 = {'老板': 225, '房间': 3361, '交通': 689, '干净': 1212, '性价比': 1251, '位置': 1969, '地铁': 26, '服务': 2939, '早餐': 1830, '环境': 1816, '夜生活': 149, '夜宵': 117, '设施': 873, '前台': 512, '设计风格': 49, '观景': 360, '浴缸': 31, '免费': 3, '隔音': 10, '卫生': 53, '接送机': 86, '卫生间': 43, '床': 9, '咖啡': 27, '停车': 23, '按摩': 6, '安静': 115, '沙滩': 18}
# 6023600: r_15 = {'服务': 7460, '环境': 2274, '房间': 5247, '设施': 1999, '免费': 1526, '早餐': 1791, '晚餐': 1426, '交通': 2230, '水果': 1084, '性价比': 2033, '咖啡': 1006, '位置': 2854, '地铁': 800, '干净': 874, '老板': 34, '卫生': 80, '观景': 101, '前台': 1196, '安静': 377}
# 1322400: r_16 = {'位置': 1920, '房间': 1218, '服务': 921, '环境': 894, '交通': 830, '性价比': 523}
# 1549300: r_17 = {'房间': 793, '干净': 310, '设施': 427, '服务': 624, '环境': 544, '性价比': 552, '老板': 18, '床': 6, '位置': 51, '卫生': 202, '大海': 240, '早餐': 86}
# 712800: r_18 = {'服务': 7054, '房间': 7523, '环境': 3512, '设施': 2380, '位置': 6384, '性价比': 2456, '交通': 2204, '早餐': 2022, '火车站': 444, '安静': 82, '老板': 38, '晒太阳': 2, '夜生活': 2, '前台': 2, '宠物': 22, '小资': 18, '院落': 16, '文艺': 15, '建筑': 14, '古香古色': 12, '浪漫': 11, '干净': 11}